espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_aux_evctl.h
// Field:    [11] AUXIO11
//
// AUXIO11 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 3.
#define AUX_EVCTL_EVSTAT0_AUXIO11                                   0x00000800
#define AUX_EVCTL_EVSTAT0_AUXIO11_BITN                                      11
#define AUX_EVCTL_EVSTAT0_AUXIO11_M                                 0x00000800
#define AUX_EVCTL_EVSTAT0_AUXIO11_S                                         11

// Field:    [10] AUXIO10
//
// AUXIO10 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 2.
#define AUX_EVCTL_EVSTAT0_AUXIO10                                   0x00000400
#define AUX_EVCTL_EVSTAT0_AUXIO10_BITN                                      10
#define AUX_EVCTL_EVSTAT0_AUXIO10_M                                 0x00000400
#define AUX_EVCTL_EVSTAT0_AUXIO10_S                                         10

// Field:     [9] AUXIO9
//
// AUXIO9   pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 1.
#define AUX_EVCTL_EVSTAT0_AUXIO9                                    0x00000200
#define AUX_EVCTL_EVSTAT0_AUXIO9_BITN                                        9
#define AUX_EVCTL_EVSTAT0_AUXIO9_M                                  0x00000200
#define AUX_EVCTL_EVSTAT0_AUXIO9_S                                           9

// Field:     [8] AUXIO8
//
// AUXIO8   pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 0.
#define AUX_EVCTL_EVSTAT0_AUXIO8                                    0x00000100
#define AUX_EVCTL_EVSTAT0_AUXIO8_BITN                                        8
#define AUX_EVCTL_EVSTAT0_AUXIO8_M                                  0x00000100
#define AUX_EVCTL_EVSTAT0_AUXIO8_S                                           8

// Field:     [7] AUXIO7
//
// AUXIO7   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 7.
#define AUX_EVCTL_EVSTAT0_AUXIO7                                    0x00000080
#define AUX_EVCTL_EVSTAT0_AUXIO7_BITN                                        7
#define AUX_EVCTL_EVSTAT0_AUXIO7_M                                  0x00000080
#define AUX_EVCTL_EVSTAT0_AUXIO7_S                                           7

// Field:     [6] AUXIO6
//
// AUXIO6   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 6.
#define AUX_EVCTL_EVSTAT0_AUXIO6                                    0x00000040
#define AUX_EVCTL_EVSTAT0_AUXIO6_BITN                                        6
#define AUX_EVCTL_EVSTAT0_AUXIO6_M                                  0x00000040
#define AUX_EVCTL_EVSTAT0_AUXIO6_S                                           6

// Field:     [5] AUXIO5
//
// AUXIO5   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 5.
#define AUX_EVCTL_EVSTAT0_AUXIO5                                    0x00000020
#define AUX_EVCTL_EVSTAT0_AUXIO5_BITN                                        5
#define AUX_EVCTL_EVSTAT0_AUXIO5_M                                  0x00000020
#define AUX_EVCTL_EVSTAT0_AUXIO5_S                                           5

// Field:     [4] AUXIO4
//
// AUXIO4   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 4.
#define AUX_EVCTL_EVSTAT0_AUXIO4                                    0x00000010
#define AUX_EVCTL_EVSTAT0_AUXIO4_BITN                                        4
#define AUX_EVCTL_EVSTAT0_AUXIO4_M                                  0x00000010
#define AUX_EVCTL_EVSTAT0_AUXIO4_S                                           4

// Field:     [3] AUXIO3
//
// AUXIO3   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 3.
#define AUX_EVCTL_EVSTAT0_AUXIO3                                    0x00000008
#define AUX_EVCTL_EVSTAT0_AUXIO3_BITN                                        3
#define AUX_EVCTL_EVSTAT0_AUXIO3_M                                  0x00000008
#define AUX_EVCTL_EVSTAT0_AUXIO3_S                                           3

// Field:     [2] AUXIO2
//
// AUXIO2   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 2.
#define AUX_EVCTL_EVSTAT0_AUXIO2                                    0x00000004
#define AUX_EVCTL_EVSTAT0_AUXIO2_BITN                                        2
#define AUX_EVCTL_EVSTAT0_AUXIO2_M                                  0x00000004
#define AUX_EVCTL_EVSTAT0_AUXIO2_S                                           2

// Field:     [1] AUXIO1
//
// AUXIO1   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 1.
#define AUX_EVCTL_EVSTAT0_AUXIO1                                    0x00000002
#define AUX_EVCTL_EVSTAT0_AUXIO1_BITN                                        1
#define AUX_EVCTL_EVSTAT0_AUXIO1_M                                  0x00000002
#define AUX_EVCTL_EVSTAT0_AUXIO1_S                                           1

// Field:     [0] AUXIO0
//
// AUXIO0   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 0.
#define AUX_EVCTL_EVSTAT0_AUXIO0                                    0x00000001
#define AUX_EVCTL_EVSTAT0_AUXIO0_BITN                                        0
#define AUX_EVCTL_EVSTAT0_AUXIO0_M                                  0x00000001
#define AUX_EVCTL_EVSTAT0_AUXIO0_S                                           0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVSTAT1
//
//*****************************************************************************
// Field:    [15] AUXIO31
//
// AUXIO31 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 7.
#define AUX_EVCTL_EVSTAT1_AUXIO31                                   0x00008000
#define AUX_EVCTL_EVSTAT1_AUXIO31_BITN                                      15
#define AUX_EVCTL_EVSTAT1_AUXIO31_M                                 0x00008000
#define AUX_EVCTL_EVSTAT1_AUXIO31_S                                         15

// Field:    [14] AUXIO30
//
// AUXIO30 pin level, read value corresponds to AUX_AIODIO3:GPIODIN bit 6.
#define AUX_EVCTL_EVSTAT1_AUXIO30                                   0x00004000
#define AUX_EVCTL_EVSTAT1_AUXIO30_BITN                                      14
#define AUX_EVCTL_EVSTAT1_AUXIO30_M                                 0x00004000
#define AUX_EVCTL_EVSTAT1_AUXIO30_S                                         14

