espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_aux_evctl.h
// Field:    [13] AUX_SMPH_AUTOTAKE_DONE
//
// See AUX_SMPH:AUTOTAKE.SMPH_ID for description.
#define AUX_EVCTL_EVSTAT3_AUX_SMPH_AUTOTAKE_DONE                    0x00002000
#define AUX_EVCTL_EVSTAT3_AUX_SMPH_AUTOTAKE_DONE_BITN                       13
#define AUX_EVCTL_EVSTAT3_AUX_SMPH_AUTOTAKE_DONE_M                  0x00002000
#define AUX_EVCTL_EVSTAT3_AUX_SMPH_AUTOTAKE_DONE_S                          13

// Field:    [12] AUX_ADC_FIFO_NOT_EMPTY
//
// AUX_ANAIF:ADCFIFOSTAT.EMPTY negated
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_NOT_EMPTY                    0x00001000
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_NOT_EMPTY_BITN                       12
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_NOT_EMPTY_M                  0x00001000
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_NOT_EMPTY_S                          12

// Field:    [11] AUX_ADC_FIFO_ALMOST_FULL
//
// AUX_ANAIF:ADCFIFOSTAT.ALMOST_FULL
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_ALMOST_FULL                  0x00000800
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_ALMOST_FULL_BITN                     11
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_ALMOST_FULL_M                0x00000800
#define AUX_EVCTL_EVSTAT3_AUX_ADC_FIFO_ALMOST_FULL_S                        11

// Field:    [10] AUX_ADC_IRQ
//
// The logical function for this event is configurable.
//
// When DMACTL.EN = 1 :
//    Event = UDMA0 Channel 7 done event     OR
// AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW
//
// When DMACTL.EN = 0 :
//    Event = (NOT AUX_ANAIF:ADCFIFOSTAT.EMPTY)      OR
// AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW
//
// Bit 7 in UDMA0:DONEMASK must be 0.
#define AUX_EVCTL_EVSTAT3_AUX_ADC_IRQ                               0x00000400
#define AUX_EVCTL_EVSTAT3_AUX_ADC_IRQ_BITN                                  10
#define AUX_EVCTL_EVSTAT3_AUX_ADC_IRQ_M                             0x00000400
#define AUX_EVCTL_EVSTAT3_AUX_ADC_IRQ_S                                     10

// Field:     [9] AUX_ADC_DONE
//
// AUX_ANAIF ADC conversion done event.
// Event is synchronized at AUX bus rate.
#define AUX_EVCTL_EVSTAT3_AUX_ADC_DONE                              0x00000200
#define AUX_EVCTL_EVSTAT3_AUX_ADC_DONE_BITN                                  9
#define AUX_EVCTL_EVSTAT3_AUX_ADC_DONE_M                            0x00000200
#define AUX_EVCTL_EVSTAT3_AUX_ADC_DONE_S                                     9

// Field:     [8] AUX_ISRC_RESET_N
//
// AUX_ANAIF:ISRCCTL.RESET_N
#define AUX_EVCTL_EVSTAT3_AUX_ISRC_RESET_N                          0x00000100
#define AUX_EVCTL_EVSTAT3_AUX_ISRC_RESET_N_BITN                              8
#define AUX_EVCTL_EVSTAT3_AUX_ISRC_RESET_N_M                        0x00000100
#define AUX_EVCTL_EVSTAT3_AUX_ISRC_RESET_N_S                                 8

// Field:     [7] AUX_TDC_DONE
//
// AUX_TDC:STAT.DONE
#define AUX_EVCTL_EVSTAT3_AUX_TDC_DONE                              0x00000080
#define AUX_EVCTL_EVSTAT3_AUX_TDC_DONE_BITN                                  7
#define AUX_EVCTL_EVSTAT3_AUX_TDC_DONE_M                            0x00000080
#define AUX_EVCTL_EVSTAT3_AUX_TDC_DONE_S                                     7

// Field:     [6] AUX_TIMER0_EV
//
// AUX_TIMER0_EV event, see AUX_TIMER01:T0TARGET for description.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER0_EV                             0x00000040
#define AUX_EVCTL_EVSTAT3_AUX_TIMER0_EV_BITN                                 6
#define AUX_EVCTL_EVSTAT3_AUX_TIMER0_EV_M                           0x00000040
#define AUX_EVCTL_EVSTAT3_AUX_TIMER0_EV_S                                    6

// Field:     [5] AUX_TIMER1_EV
//
// AUX_TIMER1_EV event, see AUX_TIMER01:T1TARGET for description.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER1_EV                             0x00000020
#define AUX_EVCTL_EVSTAT3_AUX_TIMER1_EV_BITN                                 5
#define AUX_EVCTL_EVSTAT3_AUX_TIMER1_EV_M                           0x00000020
#define AUX_EVCTL_EVSTAT3_AUX_TIMER1_EV_S                                    5

// Field:     [4] AUX_TIMER2_PULSE
//
// AUX_TIMER2 pulse event.
// Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the
// synchronization rate for this event.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_PULSE                          0x00000010
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_PULSE_BITN                              4
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_PULSE_M                        0x00000010
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_PULSE_S                                 4

// Field:     [3] AUX_TIMER2_EV3
//
// AUX_TIMER2 event output 3.
// Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the
// synchronization rate for this event.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV3                            0x00000008
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV3_BITN                                3
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV3_M                          0x00000008
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV3_S                                   3

// Field:     [2] AUX_TIMER2_EV2
//
// AUX_TIMER2 event output 2.
// Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the
// synchronization rate for this event.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV2                            0x00000004
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV2_BITN                                2
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV2_M                          0x00000004
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV2_S                                   2

// Field:     [1] AUX_TIMER2_EV1
//
// AUX_TIMER2 event output 1.
// Configuration of AUX_SYSIF:EVSYNCRATE.AUX_TIMER2_SYNC_RATE sets the
// synchronization rate for this event.
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV1                            0x00000002
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV1_BITN                                1
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV1_M                          0x00000002
#define AUX_EVCTL_EVSTAT3_AUX_TIMER2_EV1_S                                   1

