espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x2x7_cc26x2x7/inc/hw_aux_evctl.h
// Field:     [5] AUX_TIMER1_EV
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER1_EV.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER1_EV                          0x00000020
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER1_EV_BITN                              5
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER1_EV_M                        0x00000020
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER1_EV_S                                 5
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER1_EV_LOW                      0x00000020
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER1_EV_HIGH                     0x00000000

// Field:     [4] AUX_TIMER0_EV
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_TIMER0_EV.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER0_EV                          0x00000010
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER0_EV_BITN                              4
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER0_EV_M                        0x00000010
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER0_EV_S                                 4
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER0_EV_LOW                      0x00000010
#define AUX_EVCTL_EVTOMCUPOL_AUX_TIMER0_EV_HIGH                     0x00000000

// Field:     [3] AUX_TDC_DONE
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_TDC_DONE.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_TDC_DONE                           0x00000008
#define AUX_EVCTL_EVTOMCUPOL_AUX_TDC_DONE_BITN                               3
#define AUX_EVCTL_EVTOMCUPOL_AUX_TDC_DONE_M                         0x00000008
#define AUX_EVCTL_EVTOMCUPOL_AUX_TDC_DONE_S                                  3
#define AUX_EVCTL_EVTOMCUPOL_AUX_TDC_DONE_LOW                       0x00000008
#define AUX_EVCTL_EVTOMCUPOL_AUX_TDC_DONE_HIGH                      0x00000000

// Field:     [2] AUX_COMPB
//
// Select the event source edge that sets EVTOMCUFLAGS.AUX_COMPB.
// ENUMs:
// FALL                     Falling edge
// RISE                     Rising edge
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB                              0x00000004
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_BITN                                  2
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_M                            0x00000004
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_S                                     2
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_FALL                         0x00000004
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPB_RISE                         0x00000000

// Field:     [1] AUX_COMPA
//
// Select the event source edge that sets EVTOMCUFLAGS.AUX_COMPA.
// ENUMs:
// FALL                     Falling edge
// RISE                     Rising edge
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA                              0x00000002
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_BITN                                  1
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_M                            0x00000002
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_S                                     1
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_FALL                         0x00000002
#define AUX_EVCTL_EVTOMCUPOL_AUX_COMPA_RISE                         0x00000000

// Field:     [0] AUX_WU_EV
//
// Select the event source level that sets EVTOMCUFLAGS.AUX_WU_EV.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_AUX_WU_EV                              0x00000001
#define AUX_EVCTL_EVTOMCUPOL_AUX_WU_EV_BITN                                  0
#define AUX_EVCTL_EVTOMCUPOL_AUX_WU_EV_M                            0x00000001
#define AUX_EVCTL_EVTOMCUPOL_AUX_WU_EV_S                                     0
#define AUX_EVCTL_EVTOMCUPOL_AUX_WU_EV_LOW                          0x00000001
#define AUX_EVCTL_EVTOMCUPOL_AUX_WU_EV_HIGH                         0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOMCUFLAGSCLR
//
//*****************************************************************************
// Field:    [15] AUX_TIMER2_PULSE
//
// Write 1 to clear EVTOMCUFLAGS.AUX_TIMER2_PULSE.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_PULSE                  0x00008000
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_PULSE_BITN                     15
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_PULSE_M                0x00008000
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_PULSE_S                        15

// Field:    [14] AUX_TIMER2_EV3
//
// Write 1 to clear EVTOMCUFLAGS.AUX_TIMER2_EV3.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV3                    0x00004000
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV3_BITN                       14
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV3_M                  0x00004000
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV3_S                          14

// Field:    [13] AUX_TIMER2_EV2
//
// Write 1 to clear EVTOMCUFLAGS.AUX_TIMER2_EV2.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV2                    0x00002000
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV2_BITN                       13
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV2_M                  0x00002000
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV2_S                          13

// Field:    [12] AUX_TIMER2_EV1
//
// Write 1 to clear EVTOMCUFLAGS.AUX_TIMER2_EV1.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV1                    0x00001000
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV1_BITN                       12
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV1_M                  0x00001000
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV1_S                          12

// Field:    [11] AUX_TIMER2_EV0
//
// Write 1 to clear EVTOMCUFLAGS.AUX_TIMER2_EV0.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV0                    0x00000800
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV0_BITN                       11
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV0_M                  0x00000800
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_TIMER2_EV0_S                          11

